app/views/messages/create.json.jbuilder

json.content @message.content
json.created_at @message.created_at
---
INSERT INTO `messages` (`content`, `group_id`, `user_id`, `created_at`, `updated_at`) VALUES ('gggg', 5, 2, '2018-07-05 03:49:55', '2018-07-05 03:49:55')