app/controllers/messages_controller.rb

SELECT `messages`.* FROM `messages` WHERE `messages`.`group_id` = 4
---
  def index
    @message = Message.new
    @messages = @group.messages.includes(:user)

INSERT INTO `messages` (`content`, `group_id`, `user_id`, `created_at`, `updated_at`) VALUES ('gggg', 5, 2, '2018-07-05 03:49:55', '2018-07-05 03:49:55')
---
  def create
    @message = current_user.messages.new(message_params)
    if @message.save