app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE (name LIKE('%r%') AND id != 2)
---
  def index
    @users = User.where("name LIKE(?) AND id != ?", "%#{params[:keyword]}%", current_user.id)

UPDATE `users` SET `name` = 'ddddd', `updated_at` = '2018-07-02 09:45:30' WHERE `users`.`id` = 2
---
  def update
    if current_user.update(user_params)